INSERT INTO client(name,phone,email,roleName,userName,password)
VALUES
    ('小明','18248591231','18248591231@qq.com','管理员','admin001','123456nchu'),
    ('张三','18252729787','18252729787@163.com','管理员','admin002','123456nchu'),
    ('杰克','18224561735','18224561735@163.com','核对员','Checker001','123456nchu'),
    ('波才','15975097553','15975097553@163.com','发货员','Shipper001','123456nchu'),
    ('海克','19197897529','19197897529@qq.com','采购员','Buyer001','123456nchu');

insert into role(name)
values
    ('管理员'),
    ('核对员'),
    ('发货员'),
    ('采购员');

insert into goods (num,name,type,speModel,unit,sum,inPrice,outPrice,cordon)
values


insert into order_list(num,name,orderNum,price,count,pay,date,taransport,orderState,sumPrice)
values
    ('觅狐男士新款长袖T恤潮流男装上衣服打底衫ins潮牌T恤卫衣男百搭','L2021010615423500021','78','100','1','2021-01-06 15:42:35','1','JD2021010615423500188','7800'),
    ('冬季新款高端白鸭绒中青年羽绒服装男士外套时尚休闲潮流保暖外穿','L2021010616213600151','1120','50','1','2021-01-06 16:21:36','1','JD2021010616213601322','56000'),
    ('西服休闲套装男修身潮流商务正装男士新郎伴郎结婚礼服西装三件套','L2021010616223000221','768','20','1','2021-01-06 16:22:30','0','JD2021010616223000091','15360'),
    ('恒源祥冬季棉衣中长款加厚棉袄中年男装保暖棉服红色爸爸冬装外套','L2021010615423500001','288','10','1','2021-01-06 15:42:35','0','JD2021010615423500188','2880'),
    ('羽绒服男2020新款冬季白鸭绒帅气爆款工装连帽短款男士外套潮流','L2021010615423500001','1088','100','1','2021-01-06 15:42:35','0','JD2021010615423500188','10000'),
    ('2020新款冬季羽绒服男士中长款加厚保暖潮流帅气韩版修身冬装外套','L2021010615423500001','939','100','1','2021-01-06 15:42:35','0','JD2021010615423500188','10000'),
    ('进口貂皮大衣男款整貂外套皮草男装拉链连帽冬季男士水貂休闲皮衣','L2021010615423500001','2880','100','1','2021-01-06 15:42:35','0','JD2021010615423500188','10000'),
    ('棉衣加厚2020新款潮流羽绒棉服棉袄子冬装爆款潮牌秋冬季男士外套','L2021010615423500001','188','100','1','2021-01-06 15:42:35','0','JD2021010615423500188','10000'),
    ('男士可拆内胆羽绒服中老年人爸爸冬装外套加厚中长连帽派克服爷爷','L2021010615423500001','600','100','1','2021-01-06 15:42:35','0','JD2021010615423500188','10000'),
    ('花花公子裤子男冬季宽松直筒中年男士休闲长裤加绒商务爸爸装西裤','L2021010615423500001','139','100','1','2021-01-06 15:42:35','0','JD2021010615423500188','10000');

